# -*- coding: utf-8 -*-
"""Костин РК1 ИУ5-22М.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1wcRDdChXcQlktvA7ygTS1l8UKMlHBS5D

## Задача №5: Кодирование категориального признака с использованием One-Hot Encoding

Для выполнения этой задачи мы выберем категориальный признак `Sex` из набора данных `Titanic` и применим к нему метод One-Hot Encoding.
"""

import pandas as pd
import numpy as np

# Load the Titanic dataset
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

print("Original DataFrame head:")
display(df.head())

"""### One-Hot Encoding признака 'Sex'

Применим `pd.get_dummies` для выполнения One-Hot Encoding для признака `Sex`.
"""

# Perform one-hot encoding on the 'Sex' column
df_encoded = pd.get_dummies(df, columns=['Sex'], drop_first=True)

print("DataFrame after One-Hot Encoding for 'Sex' (with 'Sex_male' column):")
display(df_encoded.head())

"""## Задача №25: Обнаружение и удаление выбросов на основе межквартильного размаха (IQR)

Для выполнения этой задачи мы выберем числовой признак `Fare` из набора данных `Titanic` и проведем обнаружение и удаление выбросов на основе межквартильного размаха (IQR).
"""

# For outlier detection, we will use the original dataframe or a copy if modifications were made above.
# Let's use the df_encoded for continuity, assuming we want to apply this after encoding.

# Calculate Q1, Q3, and IQR for the 'Fare' column
Q1 = df_encoded['Fare'].quantile(0.25)
Q3 = df_encoded['Fare'].quantile(0.75)
IQR = Q3 - Q1

# Define bounds for outliers
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

print(f"Q1 (Fare): {Q1}")
print(f"Q3 (Fare): {Q3}")
print(f"IQR (Fare): {IQR}")
print(f"Lower Bound (Fare): {lower_bound}")
print(f"Upper Bound (Fare): {upper_bound}")

# Identify outliers
outliers = df_encoded[(df_encoded['Fare'] < lower_bound) | (df_encoded['Fare'] > upper_bound)]

print("\nNumber of outliers detected in 'Fare' column:", len(outliers))
print("\nOutliers in 'Fare' column:")
display(outliers[['Fare']].head())

# Remove outliers from the DataFrame
df_no_outliers = df_encoded[(df_encoded['Fare'] >= lower_bound) & (df_encoded['Fare'] <= upper_bound)]

print("\nDataFrame head after removing outliers from 'Fare' column:")
display(df_no_outliers.head())
print(f"Original DataFrame shape: {df_encoded.shape}")
print(f"DataFrame shape after outlier removal: {df_no_outliers.shape}")